::code by nameyu8023 cmd@xp
::无聊弄着玩,采用逐字对比
@echo off
::error变量值改为1将不进行校准，直接强制转换。
::强制转换，可能会导致转换完成的字符不对或一直停留在一个界面不。
set error=0
::.............
set xian=-------------------
set xian_=_____________________________________________________________________
set sum=0
set dict_WordNumber=0
setlocal enabledelayedexpansion
color 79
title 简繁体转换%xian%欢迎使用！
set a=1
::开始特效
:rea
cls
echo 欢迎使用...
set /a a+=1
mode con: cols=70 lines=%a% 
if %a% lss 30 goto rea
mode con: cols=70 lines=30
::---------------字典开始------------------------
::字典可以无限导入,形式如:simple_1 simple_2 simple_3.....simple_n
::简体字典必须与繁体字典对应,如:abc ABC 错误的如 abc bca
::没个字典中文字数不能多于1040否则会出错
::否极泰来,所以每个字典字数根据字典数来导入与,总字数/字典数=每个字典导入的字数,为最快转换速度。(不一定)
::简体字典
set simple_1=0123456789
set simple_2=abcdefghijklmnopqrstuvwxyz
set simple_3=乙一乃丁卜刀九了七八厂儿二几力人入十又匕刁久丸丈乞乡勺刃亏凡卫亿亡叉川寸弓巾女尸士夕么万三上下与习也之义于个千及大飞干工广己已口马门山才土小子丰乏乌丹予丑勾勿匀厅允互井云匹凤冈劝凶仓介仇仅仆仁仍升午订双友艺屯夫巨币尺扎巴忆幻尤孔贝父户斤木牛欠犬氏瓦牙止爪中书无不专为公六历切元五区队内办从今以化什计认反太天引开少比长车斗方风火见毛片气日手水王文心月支分丐邓冗仑讥夭歹戈卡册乎乐丘丙丛丝匆占厉刊兄兰印功击令付仙仪仔仗让讨讯训辽失央巧左归帅叨叼叮句古另叶司台叹右召闪宁奶奴犯尼饥扒扑扔汉汇汁纠圣幼冬孕轧灭斥末未旦旧礼永甘瓜禾矛母鸟皮甲申田穴甩玉业东且世主包北加务写出代们他半去记议发节边对头平布市号叫可史只它打四外处本术民必正白立龙目生石示电由用乍冯卢凹凸艾夯叭叽囚尔皿矢玄乓乒乔丢买兴冰冲厌创刚刘刑兆亚匠防邪阳阴阵网劣企伞仰伐仿伏伙伤似伟伪伍休优协充亦访讽讲延芒芝巡州迈迁迅寺寻夺夹夸巩异庆庄帆师吃吊吓吉吗吐吸驰闭闯守宇宅妇奸妈妄岂岁屿尽壮扛扣扩扫托扬执池汗汤污纪纤圾尘尖忙孙字负贞毕轨死危爷戏灯灰考朵朴杀朽杂朱欢旬早旨曲肌臣虫耳齐肉舌羽舟竹页衣血羊份共决压争划列则光先阶那关再动军农会众传价件任全华产
set simple_4=交论设许达过导并年当合各后名同向问安好如她江红级约场地在回团因多式存成观老机权收次有此百而米色西行至自匈邦阱邢凫伦伊仲亥讹讳诀讼讶廷芍芋迄迂夷弛吏吕吁吆驮驯妆屹汛纫旭肋臼串丽乱兵冻冷冶初免龟判删医阿陈附邻陆邮阻卵助劫劲励努余伯伴佛估伶伸佣亩词评诉译诊苍芳芦芹苏芽彻役迟返违迎远寿弟弄弃床库序希帐吧吵呈吹呆吨否告含吼君启吞呜吴呀驳驴驱闷闲宏宋妨妙妥妖狂犹岔岛岗尿尾饭饮壳扮抄扯抖扶抚护拒抗扭抛批抢扰折投找抓沉泛沟汽沙沈汪沃纯纺纲纳纽纱纹纸纵坝坊坏坚均坑块坛址坐困围园怀忧孝财贡歼戒灿灵灾灶材村杜杆杠李束杏杨牢攻旱旷忌忍忘肠肚肝皂私秃秀钉针盯疗鸡男穷补良辰赤豆谷麦辛言足吩坟纷芬两严况别利际即却劳但低何你体位住作克县识证花还进近连运这张应听员间完形层局声把报技没快我极来条改状时社求志更步每究系角里身走卤刨匣兑罕伺佃佑诈诅芭芙芥苇芜芯巫庇庐吠吭吝呐呕呛吮吻吟吱闰妒妓姊狈岖彤屁扳扼抠抡拟抒抑沧沪沥沦沐沛汰汹纬坎坞坠囱囤忱轩灸灼杈杉杖牡汞玖玛韧肛肖肘鸠甸甫邑乖丧乳典净卧厕券兔刺刮剂刻刷降郊郎陕限郑凯凭势侧供佳佩侨侍依侦侄卖享诚诞诗试详询叔范苦茄茎茅茂苗苹若英彼径征迫述奔奉奇幸弦底店废庙录帘帖帜咐呼呢味咏
set simple_5=驾驶驼驻闹闸宝官审宜宙宗姑姐妹妻姓狗狐岸岭岩届居屈饱饰饲拔拌抱拨拆抽担抵拐拣拘拦拢抹拍披抬拖押拥择招波泊沸河浅泪沫泥泡泼泄泻沿泳泽沾注练绍终垂垃垄坡坦固夜尚怖怪怜怕孤季孟败贩贯货贫贪贤责购轰轮软卷爸房炒炊炕炉炎视斧斩板杯柜杰枪松析枣枕枝牧版欧欣昂昌昏昆旺承环玩忽念态忠肥肺肤服股肩肯朋肾胁胀肢肿武爬秆钓盲鸣码罗畅衬衫艰虎虏舍肃齿隶鱼雨顶顷奋事其具到制些例使单参京该话建变取受往府和命周定实始委拉法油治经细线织组国图性备学质转或所规现者构果林物放明易育的直矿知空采非金青表卦刹刽陌陋郁函侈侥侣侠卑卒卓叁诡苞苟苛茉苫苔茁奈奄弧弥庞帕帚呵哎咖咕咙咆呻咒驹宠宛姆狞岳屉拗拂拇拧拓拄拙泌沽沮泞泣沼绊绅绎坷坤坯坪怯怔贬账贮炬觅枫杭枚枢枉玫昙昔氓祈殴瓮肮肪肴歧秉疙疚矾衩虱疟忿氛临举厚厘剑剃削陡险卸冒勉勇冠促俘俭俊俩侵俗侮修亮亭诵误诱语叛叙草茶荡荒茧荐茫荣药待迹迷逆送逃退追封奖奏差弯庭帮帝哀哈咳哄哗哪咸哑咽咬咱骄骆骂阀阁闻宫客室宪宣姜娇姥娃威姨姻姿独狠狡狮狭狱峡屋饼饺饶挡挂挥挤挎括挠挪拼拾拴挑挺挖挣测洞洪浑浇洁津浓洽洒洗洋洲浊绑绘绞绝络绕绒巷城垫垦垮垒尝恨恒恢恼恰孩贷费贵贺贱贸贴轻残殃施扁炮烂炼炭炸既觉览柏柄
set simple_6=栋架枯栏柳某染柔柿树柱牵牲故春显星映昼昨神祝祖拜泉玻珍怠急怒怨怎胞背胆胡脉胖胜胃歪皇皆甚秒秋钞钢钩钥钟竖盆盈毒盾眉盼眨疤疮疯疫鸦砍砌砖矩罚畏穿窃突袄虾虹蚂蚀虽蚁耐耍缸竿赴赵趴食骨鬼首香项顺美前除院养保便信南亲说很律适选将度带品响按持指活济派给结统型复点战标查政是段思总种科看省相研界类要重革面音须陨勃勋俄侯俐俏诲诫诬茬茴荤荠荚荆荔荞茸茵荧徊逊契奕哆咧咪哟咨骇闺闽宦娄娜姚狰峦屏屎饵拱拷拭挟拯洛洼涎垛垢恍恃恬恤幽贰轴飒烁炫毡柑枷柬柠柒栅栈氢昧昵昭祠泵玷玲珊胧胚胎秕钝钙钧钠钮钦盅盹鸥砂砚蚤虐籽衍韭乘羞凉剥剧剖匪陵陪陶陷兼冤倍倡倘倒俯健借俱倦倾倚债读课谅请谁谊诸谈荷获莲莫徒徐递逗逢逝透途逐射套弱座席啊唉唇哥唤哭哨唐哲阅宾害宽宵宴宰娘娱狼狸峰屑饿壶挨捕换捡捐捆捞捏捎损挽振捉涌浮浩浸浪涝润涉涛涂浴涨浙继绢绣埋恭悔悄悟悦夏贿贼毙烈轿载殊旁旅爹扇烦烘烤烧烫烟烛笔案柴档桂核桨校框栗桥桑桃桐栽株桌牺敌氧晃晋晒晌晓晕祥拿拳浆泰瓶班珠恶恩恳恐恋息脆胳脊胶朗脑胸脏脂爱秘秤秧秩租铃铅钱钳钻竞站监盐益盏眠病疾疲疼症鸭皱础破罢畜留窄袜袍袖蚕蚊耻耽缺虑耕耗紧索艳翅翁致舱航舰笋笑臭辱躬酒配赶顾顽顿预衰粉准原党部都候值调速通
set simple_7=造验家容展海流消圆离资热较料格根样特效能称积铁真被素般起难高凌凄剔匿郭卿俺倔诽诺谆荸莱莉莽莺莹逞逛哺哼唧唠哩唆哮唁骏娩峻峭馁捌挫捣捍捅捂涤涡涣涧浦涩涕埃埂圃悍悯贾赁赂赃羔殉烙梆桦栖栓桅桩氨挚殷瓷斋恕胯脓脐胰秦秫钾铆疹鸵鸯鸳砾砰砸祟畔窍袒蚌蚪蚣蚜蚓耿聂耸舀耙耘紊笆酌豹豺颁袁衷匙凑减剪副隆随隐兽勒偿假偶偏停偷谎谜谋菠菜菊菌萝萌萍萄营著逮弹康廊庸唱啦售唯啄骑寄寇密宿婚婆婶猜猎猫猛猪崇崖崭彩屠馆馅掉捷掘控掠描排捧授探掏推掀掩淡混渐淋渠渗淘添淹液渔绸绩绿绵绳绪续堵堆培堂域圈够惭惨悼惯惊惧惕惜辅辆斜旋戚毫检梨梁梅梦梢梳梯桶械犁敢救敏欲晨晚祸球患您悉悬悠爽脖脚脸脱望甜移铲铜银竟章笼盛盗盖盒盘眯睁痕痒鸽票略窑蛋蛇聋职虚粗粒粘累衔船笨笛符野距跃雪雀黄鹿麻颈袭袋做得常商接据清深维基情族断教理眼着率第象领乾厢兜匾隅凰冕勘傀偎谍谓谐谚谒菲菇菱菩萨萎萧萤徘徙巢逻逸尉奢庵庶啡唬啃啰啤啥唾啸阐阎寂娶婉婴猖崩崔崎彪彬掺捶措掸掂捺捻掐掖掷淳淀涵淮淑涮淌淆涯淫淤渊绷绰综绽缀埠堕悴惦惋赊烹焊焕梗梭梧敛晦晤祷琅琉琐曹曼脯秽秸铛铐铝铭铣铡盔眷眶痊鸿硅硕矫祭畦窒裆袱蛆蛉蚯蛀聊翎舶舵舷笙笤赦麸躯酗酝趾颅颇衅羡厨厦割剩隔隙傲傍储傅博
set simple_8=谦谢谣葱董葛葵落葡葬循御逼遍遗遇尊奥幅帽喘喊喝喉喇喷善喂喜骗阔富寒嫂猴猾屡馋插搭搁搅揭揪搂揉搜握援渡溉港湖滑渴湿湾游渣滋编缎缓缘堡塔堤堪悲惰慌慨愧禽愉赌赔赏焦煮辈辉殖焰毯棒棍椒棵棉棚棋森椅植棕牌敞敬散款欺晶景普晴暑暂智掌琴斑惩惠惑惹曾替朝腊脾腔登稍税稀锄锋锅链铺锐锁销锈铸童痛鹅硬短番窗窜窝疏裤裙裕蛮蜓蛙蛛粥絮紫舒艇策答筋筐筛筒筝筑释辜超趁趋跌践跑鲁雄雅雁黑颂街裁裂愤粪道强属提温就然斯最期程确联等量越集题装隘募凿谤蒂葫蒋遏遂逾奠喳啼喧喻骚寓媒媚婿猬猩嵌彭壹搀揣搓揩揽搔揖揍渤溅溃渺湃湘滞缔缆缕缅堰愕惶赐赋赎焙椎棺棘榔棱棠椭椰犀牍敦氮氯晾晰掰琳琼琢韩惫腌腕腋锉锌竣痘痪痢鹃甥硫硝畴窖窘蛤蛔蜒粟粤翘翔筏酣酥跋跛雳雇鼎黍颊焚鄙障勤催傻像谨叠蓝蒙蓬蒜蓄蒸微遣遥廉幕嗓嫁嫌摆搬搏搞摸摄摊携摇滨滚滥溜滤漠滩滔溪源缠缝墓塞塑塌塘填慎赖煎输煌煤楚概槐楼榆歇献暗暖福殿毁瑞愁慈愚愈腹腾腿腥腰稠锤错键锦锯锣锡盟睬督睛睡痰鹊碍碑碌碰碎碗矮禁罩罪蛾蜂舅粮粱肆筹简签触躲辟辞誉酬酱跟跪跨跳龄鉴雹雷零雾魂韵鼓鼠满照新数感想意置解路群剿谬蓖蒿蒲蓉廓幌嗤嗜嗦嗡嗅寞寝嫉媳猿馏馍搪漓溺溶溯溢滓缤缚煞辐辑斟椿楷榄楞楣楔暇瑰瑟腻腮腺稚锭
set simple_9=锚锰锨锥睹瞄睦痹痴鹏鹉碘碉硼禀署畸窟窥褂裸蜀蜕蜗蜈蛹聘肄筷誊酪跺跷靖雏靶靴魁颓颖频衙凳僚谱蔽蔑遭遮弊嘉嗽骡察寨嫩馒摧撇摔摘滴漏漫漂漆演缩境墙舞慕慢赛赚熊旗截熔熄榜榴模榨敲歌歉暮璃愿膀膊膏膜稳锻锹端竭瘦碧磁疑蜡蜜蜻蝇蜘聚腐裳裹翠箩豪辣誓酷酿貌静鲜魄鼻颗精管算酸需兢隧僧谭蔼蔓蔫蔚箫蔗幔嘀嘁寡寥嫡彰漱漩漾缨墅慷孵赘熬熙熏辖辕榕榛摹镀瘩瘟碴碟碱碳褐褪蝉舆粹舔箍箕赫酵踊雌劈僵僻蕉蔬德遵嘱播撤撑撒撕撞潮潜墨懂熟飘槽横橡樱暴摩毅慧慰膛膝稻稿镇瞒瞎蝶蝴聪糊艘箭篇箱躺醋醉趣趟踩踏踢踪靠霉震鞋黎额颜影增凛谴蕊蕴幢嘲嘿嘹嘶嬉履撮撩撵撬擒撰澳澈澄澜潦潘澎潭缭墩懊憔憎樊橄樟敷憋憨膘稽镐镊瘪瘤瘫鹤磅磕碾褥蝙蝠蝗蝌蝎褒翩篓豌豫醇鲫鲤鞍凝薄薯薪避邀嘴操激澡缴壁懒赞赠燕燃橘膨稼镜磨融糕糖篮辨辩醒蹄餐雕默衡颠器整冀儒蕾薇薛噩噪撼擂擅濒缰憾懈辙燎橙橱擎膳瓢穆瘸瘾鹦窿蟆螟螃糙翰篡篙篱篷踱蹂鲸霍霎黔藏骤擦赢戴燥臂穗瞧螺糠糟繁翼辫蹈霜霞鞠儡藐徽嚎壕懦赡檩檬檀檐曙朦臊臀爵镣瞪瞭瞬瞳癌礁磷蟥蟀蟋糜簇豁蹋鳄魏镰鹰覆翻蹦鞭藕藤嚣瀑戳瞻癞襟璧鳍爆攀瓣疆警蹲颤蘑藻攒孽癣蟹簸簿蹭蹬靡鳖羹嚼嚷灌壤耀籍躁魔巍攘蠕糯譬鳞鬓蠢霸露躏霹髓囊蘸瓤镶罐矗 
::繁体字典
set complex_1=0123456789
set complex_2=ABCDEFGHIJKLMNOPQRSTUVWXYZ
set complex_3=乙壹乃丁蔔刀九了七八廠兒二幾力人入十又匕刁久丸丈乞鄉勺刃虧凡衛億亡叉川寸弓巾女屍士夕麽萬三上下與習也之義于個千及大飛幹工廣己已口馬門山才土小子豐乏烏丹予醜勾勿勻廳允互井雲匹鳳岡勸凶倉介仇僅仆仁仍升午訂雙友藝屯夫巨幣尺紮巴憶幻尤孔貝父戶斤木牛欠犬氏瓦牙止爪中書無不專爲公六曆切元五區隊內辦從今以化什計認反太天引開少比長車鬥方風火見毛片氣日手水王文心月支分丐鄧冗侖譏夭歹戈卡冊乎樂丘丙叢絲匆占厲刊兄蘭印功擊令付仙儀仔仗讓討訊訓遼失央巧左歸帥刀叼叮句古另葉司台歎右召閃甯奶奴犯尼饑扒撲扔漢彙汁糾聖幼冬孕軋滅斥末未旦舊禮永甘瓜禾矛母鳥皮甲申田穴甩玉業東且世主包北加務寫出代們他半去記議發節邊對頭平布市號叫可史只它打四外處本術民必正白立龍目生石示電由用乍馮盧凹凸艾夯叭叽囚爾皿矢玄乓乒喬丟買興冰沖厭創剛劉刑兆亞匠防邪陽陰陣網劣企傘仰伐仿伏夥傷似偉僞伍休優協充亦訪諷講延芒芝巡州邁遷迅寺尋奪夾誇鞏異慶莊帆師吃吊嚇吉嗎吐吸馳閉闖守宇宅婦奸媽妄豈歲嶼盡壯扛扣擴掃托揚執池汗湯汙紀纖圾塵尖忙孫字負貞畢軌死危爺戲燈灰考朵樸殺朽雜朱歡旬早旨曲肌臣蟲耳齊肉舌羽舟竹頁衣血羊份共決壓爭劃列則光先階那關再動軍農會衆傳價件任全華産
set complex_4=交論設許達過導並年當合各後名同向問安好如她江紅級約場地在回團因多式存成觀老機權收次有此百而米色西行至自匈邦阱邢凫倫伊仲亥訛諱訣訟訝廷芍芋迄迂夷弛吏呂籲咬馱馴妝屹汛紉旭肋臼串麗亂兵凍冷冶初免龜判刪醫阿陳附鄰陸郵阻卵助劫勁勵努余伯伴佛估伶伸傭畝詞評訴譯診蒼芳蘆芹蘇芽徹役遲返違迎遠壽弟弄棄床庫序希帳吧吵呈吹呆噸否告含吼君啓吞嗚吳呀駁驢驅悶閑宏宋妨妙妥妖狂猶岔島崗尿尾飯飲殼扮抄扯抖扶撫護拒抗扭抛批搶擾折投找抓沈泛溝汽沙沈汪沃純紡綱納紐紗紋紙縱壩坊壞堅均坑塊壇址坐困圍園懷憂孝財貢殲戒燦靈災竈材村杜杆杠李束杏楊牢攻旱曠忌忍忘腸肚肝皂私禿秀釘針盯療雞男窮補良辰赤豆谷麥辛言足吩墳紛芬兩嚴況別利際即卻勞但低何妳體位住作克縣識證花還進近連運這張應聽員間完形層局聲把報技沒快我極來條改狀時社求志更步每究系角裏身走鹵刨匣兌罕伺佃佑詐詛芭芙芥葦蕪芯巫庇廬吠吭吝呐嘔嗆吮吻吟吱閏妒妓姊狽區彤屁扳扼摳掄擬抒抑滄滬瀝淪沐沛汰洶緯坎塢墜囪囤忱軒灸灼杈杉杖牡汞玖瑪韌肛肖肘鸠甸甫邑乖喪乳典淨臥廁券兔刺刮劑刻刷降郊郎陝限鄭凱憑勢側供佳佩僑侍依偵侄賣享誠誕詩試詳詢叔範苦茄莖茅茂苗蘋若英彼徑征迫述奔奉奇幸弦底店廢廟錄簾帖幟咐呼呢味詠
set complex_5=駕駛駝駐鬧閘寶官審宜宙宗姑姐妹妻姓狗狐岸嶺岩屆居屈飽飾飼拔拌抱撥拆抽擔抵拐揀拘攔攏抹拍披擡拖押擁擇招波泊沸河淺淚沫泥泡潑泄瀉沿泳澤沾注練紹終垂垃壟坡坦固夜尚怖怪憐怕孤季孟敗販貫貨貧貪賢責購轟輪軟卷爸房炒炊炕爐炎視斧斬板杯櫃傑槍松析棗枕枝牧版歐欣昂昌昏昆旺承環玩忽念態忠肥肺膚服股肩肯朋腎脅脹肢腫武爬稈釣盲鳴碼羅暢襯衫艱虎虜舍肅齒隸魚雨頂頃奮事其具到制些例使單參京該話建變取受往府和命周定實始委拉法油治經細線織組國圖性備學質轉或所規現者構果林物放明易育的直礦知空采非金青表卦刹劊陌陋郁函侈僥侶俠卑卒卓三詭苞苟苛茉苫苔茁奈奄弧彌龐帕帚呵哎咖咕嚨咆呻咒駒寵宛姆獰嶽屜拗拂拇擰拓拄拙泌沽沮濘泣沼絆紳繹坷坤坯坪怯怔貶賬貯炬覓楓杭枚樞枉玫昙昔氓祈毆甕肮肪肴歧秉疙疚礬衩虱瘧忿氛臨舉厚厘劍剃削陡險卸冒勉勇冠促俘儉俊倆侵俗侮修亮亭誦誤誘語叛敘草茶蕩荒繭薦茫榮藥待迹迷逆送逃退追封獎奏差彎庭幫帝哀哈咳哄嘩哪鹹啞咽咬咱驕駱罵閥閣聞宮客室憲宣姜嬌姥娃威姨姻姿獨狠狡獅狹獄峽屋餅餃饒擋挂揮擠挎括撓挪拼拾拴挑挺挖掙測洞洪渾澆潔津濃洽灑洗洋洲濁綁繪絞絕絡繞絨巷城墊墾垮壘嘗恨恒恢惱恰孩貸費貴賀賤貿貼輕殘殃施扁炮爛煉炭炸既覺覽柏柄
set complex_6=棟架枯欄柳某染柔柿樹柱牽牲故春顯星映晝昨神祝祖拜泉玻珍怠急怒怨怎胞背膽胡脈胖勝胃歪皇皆甚秒秋鈔鋼鈎鑰鍾豎盆盈毒盾眉盼眨疤瘡瘋疫鴉砍砌磚矩罰畏穿竊突襖蝦虹螞蝕雖蟻耐耍缸竿赴趙趴食骨鬼首香項順美前除院養保便信南親說很律適選將度帶品響按持指活濟派給結統型複點戰標查政是段思總種科看省相研界類要重革面音須隕勃勳俄侯俐俏誨誡誣茬茴葷荠莢荊荔荞茸茵熒徊遜契奕哆咧咪喲咨駭閨閩宦婁娜姚猙巒屏屎餌拱拷拭挾拯洛窪涎垛垢恍恃恬恤幽貳軸飒爍炫氈柑枷柬檸柒柵棧氫昧昵昭祠泵玷玲珊胧胚胎秕鈍鈣鈞鈉鈕欽盅盹鷗砂硯蚤虐籽衍韭乘羞涼剝劇剖匪陵陪陶陷兼冤倍倡倘倒俯健借俱倦傾倚債讀課諒請誰誼諸談荷獲蓮莫徒徐遞逗逢逝透途逐射套弱座席啊唉唇哥喚哭哨唐哲閱賓害寬宵宴宰娘娛狼狸峰屑餓壺挨捕換撿捐捆撈捏捎損挽振捉湧浮浩浸浪澇潤涉濤塗浴漲浙繼絹繡埋恭悔悄悟悅夏賄賊斃烈轎載殊旁旅爹扇煩烘烤燒燙煙燭筆案柴檔桂核槳校框栗橋桑桃桐栽株桌犧敵氧晃晉曬晌曉暈祥拿拳漿泰瓶班珠惡恩懇恐戀息脆胳脊膠朗腦胸髒脂愛秘秤秧秩租鈴鉛錢鉗鑽競站監鹽益盞眠病疾疲疼症鴨皺礎破罷畜留窄襪袍袖蠶蚊恥耽缺慮耕耗緊索豔翅翁致艙航艦筍笑臭辱躬酒配趕顧頑頓預衰粉准原黨部都候值調速通
set complex_7=造驗家容展海流消圓離資熱較料格根樣特效能稱積鐵真被素般起難高淩淒剔匿郭卿俺倔誹諾諄荸萊莉莽莺瑩逞逛哺哼唧唠哩唆哮唁駿娩峻峭餒捌挫搗捍捅捂滌渦渙澗浦澀涕埃埂圃悍憫賈賃賂贓羔殉烙梆桦棲栓桅樁氨摯殷瓷齋恕胯膿臍胰秦秫鉀鉚疹鴕鴦鴛礫砰砸祟畔竅袒蚌蚪蚣蚜蚓耿聶聳舀耙耘紊笆酌豹豺頒袁衷匙湊減剪副隆隨隱獸勒償假偶偏停偷謊謎謀菠菜菊菌蘿萌萍萄營著逮彈康廊庸唱啦售唯啄騎寄寇密宿婚婆嬸猜獵貓猛豬崇崖嶄彩屠館餡掉捷掘控掠描排捧授探掏推掀掩淡混漸淋渠滲淘添淹液漁綢績綠綿繩緒續堵堆培堂域圈夠慚慘悼慣驚懼惕惜輔輛斜旋戚毫檢梨梁梅夢梢梳梯桶械犁敢救敏欲晨晚禍球患您悉懸悠爽脖腳臉脫望甜移鏟銅銀竟章籠盛盜蓋盒盤眯睜痕癢鴿票略窯蛋蛇聾職虛粗粒粘累銜船笨笛符野距躍雪雀黃鹿麻頸襲袋做得常商接據清深維基情族斷教理眼著率第象領乾廂兜匾隅凰冕勘傀偎諜謂諧諺谒菲菇菱菩薩萎蕭螢徘徒巢邏逸尉奢庵庶啡唬啃啰啤啥唾嘯闡閻寂娶婉嬰猖崩崔崎彪彬摻捶措撣掂捺撚掐掖擲淳澱涵淮淑涮淌淆涯淫淤淵繃綽綜綻綴埠墮悴惦惋賒烹焊煥梗梭梧斂晦晤禱琅琉瑣曹曼脯穢稭铛铐鋁銘銑鍘盔眷眶痊鴻矽碩矯祭畦窒裆袱蛆蛉蚯蛀聊翎舶舵舷笙笤赦麸軀酗醞趾顱頗釁羨廚廈割剩隔隙傲傍儲傅博
set complex_8=謙謝謠蔥董葛葵落葡葬循禦逼遍遺遇尊奧幅帽喘喊喝喉喇噴善喂喜騙闊富寒嫂猴猾屢饞插搭擱攪揭揪摟揉搜握援渡溉港湖滑渴濕灣遊渣滋編緞緩緣堡塔堤堪悲惰慌慨愧禽愉賭賠賞焦煮輩輝殖焰毯棒棍椒棵棉棚棋森椅植棕牌敞敬散款欺晶景普晴暑暫智掌琴斑懲惠惑惹曾替朝臘脾腔登稍稅稀鋤鋒鍋鏈鋪銳鎖銷鏽鑄童痛鵝硬短番窗竄窩疏褲裙裕蠻蜓蛙蛛粥絮紫舒艇策答筋筐篩筒筝築釋辜超趁趨跌踐跑魯雄雅雁黑頌街裁裂憤糞道強屬提溫就然斯最期程確聯等量越集題裝隘募鑿謗蒂葫蔣遏遂逾奠喳啼喧喻騷寓媒媚婿猬猩嵌彭壹攙揣搓揩攬搔揖揍渤濺潰渺湃湘滯締纜縷緬堰愕惶賜賦贖焙椎棺棘榔棱棠橢椰犀牍敦氮氯晾晰掰琳瓊琢韓憊腌腕腋锉鋅竣痘瘓痢鵑甥硫硝疇窖窘蛤蛔蜒粟粵翹翔筏酣酥跋跛雳雇鼎黍頰焚鄙障勤催傻像謹疊藍蒙蓬蒜蓄蒸微遣遙廉幕嗓嫁嫌擺搬搏搞摸攝攤攜搖濱滾濫溜濾漠灘滔溪源纏縫墓塞塑塌塘填慎賴煎輸煌煤楚概槐樓榆歇獻暗暖福殿毀瑞愁慈愚愈腹騰腿腥腰稠錘錯鍵錦鋸鑼錫盟睬督睛睡痰鵲礙碑碌碰碎碗矮禁罩罪蛾蜂舅糧粱肆籌簡簽觸躲辟辭譽酬醬跟跪跨跳齡鑒雹雷零霧魂韻鼓鼠滿照新數感想意置解路群剿謬蓖蒿蒲蓉廓幌嗤嗜嗦嗡嗅寞寢嫉媳猿餾馍搪漓溺溶溯溢滓缤縛煞輻輯斟椿楷榄楞楣楔暇瑰瑟膩腮腺稚錠
set complex_9=錨錳鍁錐睹瞄睦痹癡鵬鹉碘碉硼禀署畸窟窺褂裸蜀蛻蝸蜈蛹聘肄筷謄酪跺跷靖雛靶靴魁頹穎頻衙凳僚譜蔽蔑遭遮弊嘉嗽騾察寨嫩饅摧撇摔摘滴漏漫漂漆演縮境牆舞慕慢賽賺熊旗截熔熄榜榴模榨敲歌歉暮璃願膀膊膏膜穩鍛鍬端竭瘦碧磁疑蠟蜜蜻蠅蜘聚腐裳裹翠籮豪辣誓酷釀貌靜鮮魄鼻顆精管算酸需兢隧僧譚藹蔓蔫蔚箫蔗幔滴戚寡寥嫡彰漱漩漾纓墅慷孵贅熬熙熏轄轅榕榛摹鍍瘩瘟碴碟堿碳褐褪蟬輿粹舔箍箕赫酵踴雌劈僵僻蕉蔬德遵囑播撤撐撒撕撞潮潛墨懂熟飄槽橫橡櫻暴摩毅慧慰膛膝稻稿鎮瞞瞎蝶蝴聰糊艘箭篇箱躺醋醉趣趟踩踏踢蹤靠黴震鞋黎額顔影增凜譴蕊蘊幢嘲嘿嘹嘶嬉履撮撩攆撬擒撰澳澈澄瀾潦潘澎潭缭墩懊憔憎樊橄樟敷憋憨膘稽鎬鑷癟瘤癱鶴磅磕碾褥蝙蝠蝗蝌蠍褒翩簍豌豫醇鲫鯉鞍凝薄薯薪避邀嘴操激澡繳壁懶贊贈燕燃橘膨稼鏡磨融糕糖籃辨辯醒蹄餐雕默衡顛器整冀儒蕾薇薛噩噪撼擂擅瀕缰憾懈轍燎橙櫥擎膳瓢穆瘸瘾鹦窿蟆螟螃糙翰篡篙籬篷踱蹂鯨霍霎黔藏驟擦贏戴燥臂穗瞧螺糠糟繁翼辮蹈霜霞鞠儡藐徽嚎壕懦贍檩檬檀檐曙朦臊臀爵鐐瞪瞭瞬瞳癌礁磷蟥蟀蟋糜簇豁蹋鳄魏鐮鷹覆翻蹦鞭藕藤囂瀑戳瞻癞襟璧鳍爆攀瓣疆警蹲顫蘑藻攢孽癬蟹簸簿蹭蹬靡鼈羹嚼嚷灌壤耀籍躁魔巍攘蠕糯譬鱗鬓蠢霸露躏霹髓囊蘸瓤鑲罐矗 
::----------------字典结束------------------------

::对字典字数校准
if %error% equ 1 goto memu
for /l %%a in (1,1,10) do echo\
echo                    正在对字典做简略校准,进行中...
set dict_count=0
:aline_1
set /a dict_count+=1
if defined simple_%dict_count% (
	set simpledict=%dict_count% 
	goto aline_1
)
set dict_count=0
:aline_2
set /a dict_count+=1
if defined complex_%dict_count% (
	set complexdict=%dict_count% 
	goto aline_2
)
set aline_num=0
:aline_3
set /a aline_num+=1
if defined simple_%aline_num% (
	set count=0
	call:aline_4 !simple_%aline_num%! 简体%aline_num% simpledict_%aline_num%_word
)
if defined complex_%aline_num% (
	set count=0
	call:aline_4 !complex_%aline_num%! 繁体%aline_num% complexdict_%aline_num%_word
)
if not %aline_num% equ %simpledict% goto aline_3
for /l %%a in (1,1,%simpledict%) do (
	set /a dict_WordNumber=!dict_WordNumber!+!simpledict_%%a_word!
)
if not %simpledict% equ %complexdict% goto error_1
for /l %%a in (1,1,%simpledict%) do (
	if not !simpledict_%%a_word! equ !complexdict_%%a_word! (
		goto error_1
	)
)
goto memu
::错误提示
:error_1
title 简繁体转换%xian%词典错误！
cls
for /l %%a in (1,1,4) do echo\
echo                             词典错误！
echo\
echo                      简体字典数:%simpledict%简体字典数:%complexdict%
echo\
if %simpledict% lss %complexdict% (
	for /l %%a in (1,1,%complexdict%) do (
		echo                 简体字典%%a:字数:!simpledict_%%a_word! 简体字典%%a:字数:!complexdict_%%a_word!
	)
) else (
	for /l %%a in (1,1,%simpledict%) do (
		echo                 简体字典%%a:字数:!simpledict_%%a_word! 简体字典%%a:字数:!complexdict_%%a_word!
	)
)
echo\
echo                          ^<Y^> 键强制转换
echo\
echo                           关闭直接回车
:int
echo\
set int=
set /p int=请选择^<Y/Enter ←━┛^>:
if /i "%int%"=="y" goto memu
if /i "%int%"=="" goto over
goto int
::主菜单
:memu
title 简繁体转换%xian%字典总字数:%dict_WordNumber%
cls
for /l %%a in (1,1,5) do echo\
echo                            简繁体转换
echo         ミ━━━━━━━━━━━━━━━━━━━━━━━━ミ
echo         ┇          简体--^>繁体 and 繁體--^>簡體           ┇
echo         ┇                                                ┇
echo         ┇        可以使单字或整行,直接输入按回车         ┇
echo         ┇                                                ┇
echo         ┇                关闭直接回车                    ┇
echo         ミ━━━━━━━━━━━━━━━━━━━━━━━━ミ
echo\
echo          你需要转换什么?
echo\
set input_num=0
set input=
set /p input=:
if /i "%input%"=="" goto over
cls
echo\
echo                                 转换前
echo %xian_%
echo %input%
echo %xian_%
echo\
echo                                 转换后
echo %xian_%

:input_1
::设置输入加"`"用于比对
set input=%input%`
set contrast_num=0
::提取输入的每个字符
set input_1=!input:~%input_num%,1!
if "%input_1%"=="`" goto end
set small_%dict_num%=1
set Large_%dict_num%=1
set dict_num=0
::判断字典里是否存在and简体或繁体
:judge
set /a dict_num+=1
if not defined simple_%dict_num% goto ratio
echo !simple_%dict_num%!|findstr "%input_1%">nul 2>nul
if %ERRORLEVEL% equ 0 (
	set small_%dict_num%=0
	goto ratio
)
echo !complex_%dict_num%!|findstr "%input_1%">nul 2>nul
if %ERRORLEVEL% equ 0 (
	set Large_%dict_num%=0
	goto ratio
)
goto judge
::调用contrast逐字对比
:ratio
if "!small_%dict_num%!" equ "0" (
	set /a sum+=1
	call:contrast !simple_%dict_num%! !complex_%dict_num%! !complexdict_%dict_num%_word!
	)
if "!Large_%dict_num%!" equ "0" (
	set /a sum+=1
	call:contrast !complex_%dict_num%! !simple_%dict_num%! !simpledict_%dict_num%_word!
)
::显示每个字符
set /p=!input_1!<nul
set /a input_num+=1
goto input_1

::逐字对比
:contrast
set contrast_1=%1
set contrast_2=%2
title 简繁体转换%xian%正在进行转换^<%input_1%^>--%dict_num%/%3/%contrast_num%
::设置字典里的每个字符
set contrast_1=!contrast_1:~%contrast_num%,1!
::对比出在字典里的位置
if "%input_1%"=="%contrast_1%" (
	::设置转换后的每个字符
	set contrast_2=!contrast_2:~%contrast_num%,1!
	set input_1=!contrast_2!
	goto :eof
)
set /a contrast_num+=1
goto contrast

::提示信息
:end
echo\
title 简繁体转换%xian%总转换数:^<%sum%^>
echo %xian_%
echo\
echo\
echo                       转换结束,若要复制:
echo         点击鼠标右键--^>标记--^>选中要复制的--^>按回车即可
echo                      输入任意键返回住菜单
echo                          关闭直接回车
echo\
set input_=        
set /p input_=你想让它做什么?:
if /i "%input_%"=="" goto over
goto memu
::字典字数校准
:aline_4
set /a count+=1
set string=%1
title 简繁体转换%xian% 校准字典__:%2/%count%
if not "!string:~%count%,1!" equ "" goto aline_4
set %3=%count%
goto :eof
::结束特效
:over
color 79
set b=30
:reb
cls
echo 正在退出...
set /a b-=1
mode con: cols=70 lines=%b%
if %b% gtr 1 goto reb
exit