#!/usr/bin/python3
#-*- coding: utf-8 -*-
#棋子走法评分

'''
活5 = 五子连珠
活4 = 四子连珠，双边皆可落子
冲4 = 四子连珠，单边可落子
眠4 = 中间插入一子可成五了连珠

活3 = 三子连珠，双边皆可落子
冲3 = 三子连珠，单边可落子
眠3 = 中间插入一子可成冲四

'''
#此因子写入棋子成活方式,并给出一个评分
#使用字符串表示连棋状态
#　'1'代表我方棋子;'0'代表空子;'2'代表对方棋子
evaluateFactor = {
        '11111':100000,     #五连

        '011110':10000,     #活四
        '211110':5000,      #冲四
        '011112':5000,      #冲四
        '10111':2500,       #眠四
        '11011':2500,       #眠四
        '11101':2500,       #眠四


        '01110':1000,       #活三
        '11001':500,        #双跳三
        '10011':500,        #双跳三

        '21110':500,        #冲三
        '01112':500,        #冲三
        '10110':250,        #眠三
        '11010':250,        #眠三
        '211112':50,        #死三
        '211102':50,        #死三
        '211012':50,        #死三
        '211012':50,        #死三
        '210112':50,        #死三
        '201112':50,        #死三
        '21112':25,         #死三


        '0110':100,         #活二
        '2110':50,          #冲二
        '0112':50,          #冲二
        '1010':25,          #眠二
        '0101':25,          #眠二
        '20112':25,         #死三
        '21012':25,         #死三
        '21102':25,         #死三
        '2112':10,          #死二

        '1':5,              #跟子
}

if __name__ == '__main__':
        print(evaluateFactor)